Revit 2017 API
ElectricalSystem.RunsNumber Property
Returns the Runs Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public int RunsNumber { get; }
Visual Basic
Public ReadOnly Property RunsNumber As Integer
	Get
Visual C++
public:
property int RunsNumber {
	int get ();
}
Remarks
This property is used to retrieve the Runs Number of the Electrical System.
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace